import os
from dotenv import load_dotenv
from telegram import ReplyKeyboardMarkup, KeyboardButton
from telegram.ext import Updater, CommandHandler, MessageHandler, Filters

load_dotenv()
BOT_TOKEN = os.getenv("BOT_TOKEN")

def create_menu():
    # Create a list of button rows
    keyboard = [
        [KeyboardButton("حول المنصة")],
        [KeyboardButton("حول الوزارة")],
        [KeyboardButton("حول الشركة المطورة")],
        [KeyboardButton("سمعنا صوتك")],
    ]
    return ReplyKeyboardMarkup(
        keyboard=keyboard,
        resize_keyboard=True,
        one_time_keyboard=True
    )

def start(update, context):
    context.bot.send_message(
        chat_id=update.effective_chat.id,
        text= "مرحباََ بك في منصة صوتك",
        reply_markup=create_menu()
    )

def handle_message(update, context):
    response = {
        "حول المنصة": "منصة صوتك هي المنصة الأولى للمواطنين للتعبير عن آرائهم ومقترحاتهم وتقديم شكاويهم في كل المواضيع والخدمات والجهات العاملة تحت وزارة التقانة والاتصالات للجمهورية العربية السورية وقريباً في جميع الوزارات",
        "حول الوزارة": "",
      "حول الشركة المطورة": "مجموعة أوتوماتا4 هي شركة إقليمية مكرسة لتقديم حلول وخدمات استشارية مخصصة عالية الجودة لتكنولوجيا المعلومات. من خلال تواجدنا في العديد من المواقع حول العالم والتحالفات الاستراتيجية التي لدينا مع شركات تكنولوجيا المعلومات من الشرق الأوسط وأوروبا والأمريكتين، توفر مجموعة أوتوماتا4 موارد محلية وإقليمية ووطنية وعالمية للعملاء في جميع أنحاء العالم لتطوير واستشارات تكنولوجيا المعلومات. ضاعفت الشركة دخلها تقريبًا في السنوات الثلاث الماضية، وتخدم أكثر من 63 عميلًا ومؤسسات ضخمة في العديد من المناطق حول العالم.  تتراوح خدمات مجموعة أوتوماتا4 من الاستعانة بمصادر خارجية لتطوير المنتجات، إلى التعريف الكامل لحلول الأعمال الإلكترونية / الحكومة الإلكترونية، والتصميم، والتطوير، والاختبار، والنشر، والصيانة.  أثبتت مجموعة أوتوماتا4 قدراتها من خلال خدمة العملاء بنجاح في جميع أنحاء العالم وضمان نجاحهم من خلال مزيج فريد من النهج التعاوني والاستشاري، والقدرة التقنية، ونموذج التسليم العالمي عالي الجودة.  تساعد مجموعة أوتوماتا4 عملاءها على النجاح من خلال مزيج فريد من النهج التعاوني والاستشاري، والقدرة التقنية، ونموذج التسليم العالمي عالي الجودة.  تمتلك مجموعة أوتوماتا4 خبرة في المجالات التالية: الحكومة الإلكترونية، والأعمال التجارية الإلكترونية، والاتصالات، والتمويل والمصارف، والنقل. تشمل الإمكانات التكنولوجية تقنيات Microsoft، وتقنية المصدر المفتوح، وتقنيات الشبكات، وتقنيات Unix، وتطوير قواعد البيانات، و UML. نظرًا لطبيعة قاعدة عملاء مجموعة أوتوماتا4، تستخدم المجموعة أحدث التقنيات والأدوات وعمليات الجودة لتقديم حلول مصممة خصيصًا.  بعض إنجازاتنا البارزة هي قسم البحث والتطوير لدينا، وخطتنا للحصول على شهادة CMMI من المستوى 3، وتحويلنا إلى أحدث المعايير الدولية (BPMN - تدوين نمذجة عمليات الأعمال، SOA - البنية الموجهة للخدمة، BMM - نموذج تحفيز الأعمال، UML - لغة النمذجة الموحدة، BPD - مخططات عمليات الأعمال، BAM - مراقبة نشاط الأعمال) وغير ذلك الكثير.  تلتزم مجموعة أوتوماتا4 بتقديم خدمات تكامل أنظمة فائقة، وتوفير حلول الأعمال الإلكترونية الكاملة جنبًا إلى جنب مع الاستشارات المهنية للعملاء في الأسواق المحلية والإقليمية والدولية. يتم تحقيق ذلك من خلال فريق من المهندسين والاستشاريين ذوي الخبرة العالية، مدعومًا بشراكات استراتيجية إلى جانب استخدام معايير ومنهجيات أعلى.",  
       "سمعنا صوتك": "Coming Soon",  
    }.get(update.message.text, "يرجى اختيار خيار من القائمة.")
    
    context.bot.send_message(
        chat_id=update.effective_chat.id,
        text=response,
        reply_markup=create_menu()
    )

def main():
    updater = Updater(token=BOT_TOKEN, use_context=True)
    dispatcher = updater.dispatcher
    
    dispatcher.add_handler(CommandHandler('start', start))
    dispatcher.add_handler(MessageHandler(Filters.text & ~Filters.command, handle_message))
    
    print("Bot is running...")
    updater.start_polling()
    updater.idle()

if __name__ == '__main__':
    main()
